[
  {
    "customFields": [
      {
        "title": "Become part of the team",
        "content": "<p>With our broad, international and many years of expertise, we advise our clients in many sectors like Manufacturing, Consumer, Financial / Professional Services, Energy, Transport and the Public Sector.</p>"
      },
      {
        "title": "What we're looking for",
        "content": "<p>To strengthen our Manufacturing Team in The Netherlands, we are looking for:</p>\n<p> </p>\n<p><strong>(Senior) Consultants Manufacturing / Supply Chain</strong></p>\n<p>with a proven track record in business / management consulting within the manufacturing sector and who are up for making the difference with our clients. We are expanding our team with (Senior) Consultants who have a broad range of skills and transformational consulting and a background in the sector. You are a consulting professional in one or more of the following areas: ERP, Product Lifecycle / Configuration Management, Innovation (technical and market), Digital and Data in Manufacturing, Supply Chain, Business Model Design, and Process Design.</p>\n<p> </p>\n<p><strong>Scope of the role</strong></p>\n<p>Main purpose of the role is be participating in and leading work streams of multidisciplinary PA and client teams to deliver the best end result for our clients, from idea to realisation. The projects for our clients will involve you in managing stakeholders and supporting and managing (organisational) change. As a (Senior) Consultant in our firm, you are keen to contribute to sales initiatives and thought leadership, all of this leading to you building further competencies and value propositions which will help PA to acquire new clients and expand our business with our current clients and grow your career within the firm.</p>\n<p><strong><br /> </strong></p>\n<p><strong> </strong></p>\n<p><strong>Personal and professional qualities and background</strong></p>\n<p><strong> </strong></p>\n<p>Depending on your years of experience, you can “deliver” on the following:</p>\n<p> </p>\n<p> </p>\n<ul>\n<li>Lead his own work and 1 - 2 others, interact with the client about the job and deliver good outputs – or when more experienced, shape a job, manage a team of 3 - 5 consultants including client staff and present/lead at project board level, and operates own network and able to deliver sales from own network.</li>\n<li>Outgoing and eager to build own network and able to spot sales opportunities at existing clients.</li>\n<li>Excellent presentation skills, strong communicator. Outgoing. Exploring type of attitude, connecting to people from angle of genuine interest. Analytical ability.</li>\n<li>Excellent intervention skills, able to cope with complex situations where managing emotions and politics is as important as ratio.</li>\n<li>Dares to lead but can also be humble and listen very well. Analytical ability.</li>\n<li>For the most senior roles, you are able to fully shape the job and lead a mixed team of PA staff, client staff and external partners to a positive business outcome for the client – using your extensive network, including CXO level of medium-sized and big corporates and good sparring partner at that level, ability to spot opportunities, sell, shape jobs and build an account. Self-supporting. You can fully bridge between functional barriers, between IT and Business and across geographies. Skilled international project management is a must-have ´basic´ to do well. Opinion leader in his trade. Publishes on topics. Regular presenter at conferences.</li>\n</ul>\n<p> </p>\n<p>For all levels you would require showing:</p>\n<p> </p>\n<ul>\n<li>Strong interpersonal skills with excellent verbal and written communication (in Dutch and English)</li>\n<li>Willingness to work abroad as PA is an international consulting firm</li>\n<li>Strong intellectual and analytical skills, proven by an academic background with preferably a technical / engineering background with applied digital skills and knowledge</li>\n</ul>\n<p> </p>"
      },
      {
        "title": "Benefits",
        "content": "<p> </p>\n<p>Apart from a base salary which is in line with practice, we offer:</p>\n<p> </p>\n<ul>\n<li>35 holidays per year (including statutory days)</li>\n<li>opportunity to buy additional flex holidays (maximum of 7)</li>\n<li>performance bonus</li>\n<li>pension plan (with fixed percentage personal contribution)</li>\n<li>possibility to buy shares in PA</li>\n<li>company car / car allowance</li>\n</ul>"
      },
      {
        "title": "About us",
        "content": "<p>We’re an innovation and transformation consultancy that believes in the power of ingenuity to build a positive-human future in a technology-driven world. Our diverse teams of experts combine innovative thinking with breakthrough-technologies to progress further, faster. With a global network of FTSE 100 and Fortune 500 clients, we’ll offer you unrivalled opportunities for growth and the freedom to excel. Combining strategies, technologies and innovation, we create opportunity from complexity and deliver enduring results, enabling you to build a lasting career.</p>\n<p> </p>"
      },
      {
        "title": "Diversity Statement",
        "content": "<p>We believe that diversity makes us a stronger firm and look to employ people with different ideas, styles and skillsets. This diversity stimulates a rich, creative environment – one in which our people develop, and our clients enjoy enduring results. We’re committed to recruiting, promoting and rewarding our people solely based on their ability to contribute to PA’s goals, without regard to their sex, race, disability, religion, national origin, ethnicity, sexual orientation, age or marital status. We welcome international applications, but we are unable to offer sponsorship for work permits, so you will need to have the full right to live and work in The Netherlands. Unfortunately, your application will be automatically rejected if you do not have these rights. It is a prerequisite to have a proficiency in the Dutch language at B1 level.</p>"
      }
    ],
    "jobFields": {
      "SLOVLIST13": "Utrecht",
      "SLOVLIST16": "Full Time",
      "SLOVLIST15": "Netherlands",
      "ContractTyplabel": "Permanent",
      "sJobTitle": "(Senior) Consultant Manufacturing / (Digital) Supply Chain",
      "id": 915,
      "siteLangauge": "UK",
      "language": "UK",
      "jobNumber": "EU00008",
      "jobTitle": "(Senior) Consultant Manufacturing / (Digital) Supply Chain",
      "externalJobNumber": null,
      "applicationUrl": "https://apply5.lumessetalentlink.com/apply-app/pages/application-form?jobId=QIMFK026203F3VBQBLO6GLOQP-915&langCode=en_GB",
      "strapLine": null,
      "POSTINGTIMEZONE": "Europe/London"
    },
    "id": 915,
    "title": "(Senior) Consultant Manufacturing / (Digital) Supply Chain",
    "city": "Utrecht",
    "country": "Netherlands",
    "location": "Utrecht, Netherlands",
    "capability": "Other",
    "summary": "With our broad, international and many years of expertise, we advise our clients in many sectors like Manufacturing, Consumer, Financial / Professional Services, Energy, Transport and the Public Sector.",
    "fulltext": "With our broad, international and many years of expertise, we advise our clients in many sectors like Manufacturing, Consumer, Financial / Professional Services, Energy, Transport and the Public Sector. To strengthen our Manufacturing Team in The Netherlands, we are looking for:\n \n(Senior) Consultants Manufacturing / Supply Chain\nwith a proven track record in business / management consulting within the manufacturing sector and who are up for making the difference with our clients. We are expanding our team with (Senior) Consultants who have a broad range of skills and transformational consulting and a background in the sector. You are a consulting professional in one or more of the following areas: ERP, Product Lifecycle / Configuration Management, Innovation (technical and market), Digital and Data in Manufacturing, Supply Chain, Business Model Design, and Process Design.\n \nScope of the role\nMain purpose of the role is be participating in and leading work streams of multidisciplinary PA and client teams to deliver the best end result for our clients, from idea to realisation. The projects for our clients will involve you in managing stakeholders and supporting and managing (organisational) change. As a (Senior) Consultant in our firm, you are keen to contribute to sales initiatives and thought leadership, all of this leading to you building further competencies and value propositions which will help PA to acquire new clients and expand our business with our current clients and grow your career within the firm.\n \n \nPersonal and professional qualities and background\n \nDepending on your years of experience, you can “deliver” on the following:\n \n \n\nLead his own work and 1 - 2 others, interact with the client about the job and deliver good outputs – or when more experienced, shape a job, manage a team of 3 - 5 consultants including client staff and present/lead at project board level, and operates own network and able to deliver sales from own network.\nOutgoing and eager to build own network and able to spot sales opportunities at existing clients.\nExcellent presentation skills, strong communicator. Outgoing. Exploring type of attitude, connecting to people from angle of genuine interest. Analytical ability.\nExcellent intervention skills, able to cope with complex situations where managing emotions and politics is as important as ratio.\nDares to lead but can also be humble and listen very well. Analytical ability.\nFor the most senior roles, you are able to fully shape the job and lead a mixed team of PA staff, client staff and external partners to a positive business outcome for the client – using your extensive network, including CXO level of medium-sized and big corporates and good sparring partner at that level, ability to spot opportunities, sell, shape jobs and build an account. Self-supporting. You can fully bridge between functional barriers, between IT and Business and across geographies. Skilled international project management is a must-have ´basic´ to do well. Opinion leader in his trade. Publishes on topics. Regular presenter at conferences.\n\n \nFor all levels you would require showing:\n \n\nStrong interpersonal skills with excellent verbal and written communication (in Dutch and English)\nWillingness to work abroad as PA is an international consulting firm\nStrong intellectual and analytical skills, proven by an academic background with preferably a technical / engineering background with applied digital skills and knowledge\n\n  We’re an innovation and transformation consultancy that believes in the power of ingenuity to build a positive-human future in a technology-driven world. Our diverse teams of experts combine innovative thinking with breakthrough-technologies to progress further, faster. With a global network of FTSE 100 and Fortune 500 clients, we’ll offer you unrivalled opportunities for growth and the freedom to excel. Combining strategies, technologies and innovation, we create opportunity from complexity and deliver enduring results, enabling you to build a lasting career.\n "
  },
  {
    "customFields": [
      {
        "title": "Become part of the team",
        "content": "<p>Met onze brede, internationale en jarenlange expertise adviseren we onze klanten in een groot aantal sectoren, waaronder Manufacturing, Consumer, Financial Services, Energie- en Transport- en in de Publieke Sector.</p>\n<p><strong>Opdrachtgevers helpen hun digitale ambities te realiseren</strong></p>\n<p>PA’s Digital Team helpt onze klanten competitief te zijn en voorop te lopen in hun markt in dit  digitale tijdperk.</p>\n<p>We zitten midden in een tijdperk van disruptie van bestaande business modellen en de creatie van nieuwe markten. Organisaties worstelen voortdurend om zich aan te passen aan deze veranderingskracht. Onze digitale barometer vertelt ons dat bij vele organisaties niet ontbreekt aan digitale ambities niet ontbreekt, maar de meerderheid van deze organisaties nog een lange weg te gaan hebben om zich te transformeren in dit digitale tijdperk. En de wereld staat uiteraard niet stil:  elke dag ontstaan er nieuwe toepassingen, nieuwe ondernemingen of een nieuwe “disruptors” die de bestaande elite uitdagen.</p>\n<p>PA’s Digital Team is een virtueel team van experts in “digital” die onze klanten vanuit verschillende invalshoeken ondersteunen in hun digitale transformaties. Het team bestaat uit sectorspecialisten, organisatie- en cultuurveranderingsexperts, customer experience en digital proposition goeroes, technologie en IT & data specialisten, samengesteld vanuit verschillende PA sector- en service teams en landen. Ons werk omvat strategie, transformatie en implementatie. We praten niet alleen over “<em>the Internet of Things</em>”, maar we bedenken, ontwerpen en produceren tevens de volgende generatie van “<em>connected devices</em>” vanuit ons Technology Centre in Cambridge (UK).</p>"
      },
      {
        "title": "What we're looking for",
        "content": "<p>Om ons Digital Team verder te versterken, en om klanten te kunnen helpen zich te transformeren in deze digital age en hun digitale bestemming te laten bereiken, maken we graag kennis met:</p>\n<p><strong>(Senior) Digital Business </strong><strong>Consultants</strong></p>\n<p>met een aantoonbaar track record als Digital Expert met een passie voor verandering: “digital natives” die deel willen uitmaken van een snelgroeiend (internationaal) team van digital (business) experts die willen helpen deze service voor PA verder uit te bouwen en samen willen werken met onze klanten in verschillende uitdagende opdrachten.</p>\n<p><strong><em>De rol</em></strong></p>\n<p>Belangrijkste doel van deze rol is het nauw samenwerken met onze opdrachtgevers in innovatieve, geïntegreerde business, IT en culturele veranderingstrajecten, waarbij je tevens een leidende rol speelt in het managen van stakeholders en in de ondersteuning en het managen van organisatieverandering. Als Consultant lever je graag een bijdrage aan salesinitiatieven en Thought Leadership, met als doel een verdere uitbouw van competenties en proposities die helpen nieuwe opdrachten en opdrachtgevers te acquireren en onze bestaande klanten uit te bouwen en natuurlijk de groei van jouw eigen carrière bij PA.</p>\n<p>Je begrijpt als geen ander welke uitdagingen onze klanten hebben bij het streven om voordeel te behalen uit de kansen die “digital” biedt, en je hebt de passie om alles in het werk te stellen om hen hierbij succesvol te maken.</p>\n<p><strong><em>Persoonlijke en professionele kwaliteiten</em></strong></p>\n<p><strong> </strong><strong> </strong></p>\n<ul>\n<li>Je neemt een solide en aantoonbare ervaring mee in Digital Business en/of Consultancy en Business Development – een minimum van 8 tot 10 jaar is zo’n beetje de ondergrens</li>\n<li>Je hebt een actief netwerk in verschillende sectoren en hebt ervaring in het verkopen van professionele services binnen dit netwerk – van voorstel tot pitch en “closing the deal”</li>\n<li>Je hebt ervaring en expertise in digital strategie, digital business / operations ontwerp, digitale transformatie en hebt deze expertise ingezet op CxO niveau</li>\n<li>Je beschikt over diepgaande expertise in onderwerpen als digital marketing, customer experience, digital strategy, proposition development, analytics, case for change, technologie en IT – en je bent in staat om overtuigende marktproposities te schrijven die de aandacht van onze klanten trekken en waarmee je de concurrentie ver achter je laat. Met betrekking tot deze onderwerpen word je in de markt gezien als een Thought Leader.</li>\n<li>Je hebt een track record in het helpen tackelen van de grootste digitale uitdagingen van jouw klanten, en weet hoe je hen (competitief en duurzaam) voordeel kunt laten behalen uit wat “digital” hen heeft te bieden</li>\n<li>Het managen van gemengde klant-toeleverancier teams en het leveren van de gewenste uitkomst voor de klant is voor jou vanzelfsprekend</li>\n<li>Sterke intellectuele en analytische vaardigheden, gebaseerd op een academische achtergrond, maar met goed ontwikkelde plannings- en realisatievaardigheden en de vaardigheid om te schakelen tussen hands-on en hands-off – afhankelijk van de situatie</li>\n<li>Sterke klantfocus, ambitieus, ondernemend en collegiaal, een motiverende persoonlijke en authentieke stijl, team player</li>\n<li>Bovengemiddelde presentatie-, onderhandelings- en beïnvloedingsvaardigheden, in staat om de “lead” te nemen bij organisatieverandering, organisatiesensitief en bruggenbouwer</li>\n<li>Sterke interpersoonlijke vaardigheden, excellente schriftelijke en verbale communicatievaardigheden (in Nederland en Engels)</li>\n<li>Proactieve houding, duidelijke ideeën, bereidheid om ook internationaal te werken</li>\n</ul>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>"
      },
      {
        "title": "Benefits",
        "content": "<p>Apart from a base salary which is in line with practice, we offer:</p>\n<p> </p>\n<ul>\n<li>35 holidays per year (including statutory days)</li>\n<li>opportunity to buy additional flex holidays (maximum of 7)</li>\n<li>performance bonus</li>\n<li>pension plan (with fixed percentage personal contribution)</li>\n<li>possibility to buy shares in PA</li>\n</ul>\n<p>company car / car allowance</p>"
      },
      {
        "title": "About us",
        "content": "<p>We’re an innovation and transformation consultancy that believes in the power of ingenuity to build a positive-human future in a technology-driven world. Our diverse teams of experts combine innovative thinking with breakthrough-technologies to progress further, faster. With a global network of FTSE 100 and Fortune 500 clients, we’ll offer you unrivaled opportunities for growth and the freedom to excel. Combining strategies, technologies and innovation, we create opportunity from complexity and deliver enduring results, enabling you to build a lasting career.</p>"
      },
      {
        "title": "Diversity Statement",
        "content": "<p>We believe that diversity makes us a stronger firm and look to employ people with different ideas, styles and skill sets. This diversity stimulates a rich, creative environment – one in which our people develop, and our clients enjoy enduring results. We’re committed to recruiting, promoting and rewarding our people solely based on their ability to contribute to PA’s goals, without regard to their sex, race, disability, religion, national origin, ethnicity, sexual orientation, age or marital status. We welcome international applications, but we are unable to offer sponsorship for work permits, so you will need to have the full right to live and work in The Netherlands. Unfortunately, your application will be automatically rejected if you do not have these rights. It is a prerequisite to have a proficiency in the Dutch language at B1 level.</p>"
      }
    ],
    "jobFields": {
      "SLOVLIST13": "Utrecht",
      "SLOVLIST16": "Full Time",
      "SLOVLIST15": "Netherlands",
      "ContractTyplabel": "Permanent",
      "sJobTitle": "(Senior) Digital Business Consulant",
      "id": 936,
      "siteLangauge": "UK",
      "language": "UK",
      "jobNumber": "EU00007",
      "jobTitle": "(Senior) Digital Business Consulant",
      "externalJobNumber": null,
      "applicationUrl": "https://apply5.lumessetalentlink.com/apply-app/pages/application-form?jobId=QIMFK026203F3VBQBLO6GLOQP-936&langCode=en_GB",
      "strapLine": null,
      "POSTINGTIMEZONE": "Europe/London"
    },
    "id": 936,
    "title": "(Senior) Digital Business Consulant",
    "city": "Utrecht",
    "country": "Netherlands",
    "location": "Utrecht, Netherlands",
    "capability": "Transformation",
    "summary": "Met onze brede, internationale en jarenlange expertise adviseren we onze klanten in een groot aantal sectoren, waaronder Manufacturing, Consumer, Financial Services, Energie- en Transport- en in de Publieke Sector.\nOpdrachtgevers helpen hun digitale ambities te realiseren\nPA’s Digital Team helpt onze klanten competitief te zijn en voorop te lopen in hun markt in dit  digitale tijdperk.\nWe zitten midden in een tijdperk van disruptie van bestaande business modellen en de creatie van nieuwe markten...",
    "fulltext": "Met onze brede, internationale en jarenlange expertise adviseren we onze klanten in een groot aantal sectoren, waaronder Manufacturing, Consumer, Financial Services, Energie- en Transport- en in de Publieke Sector.\nOpdrachtgevers helpen hun digitale ambities te realiseren\nPA’s Digital Team helpt onze klanten competitief te zijn en voorop te lopen in hun markt in dit  digitale tijdperk.\nWe zitten midden in een tijdperk van disruptie van bestaande business modellen en de creatie van nieuwe markten. Organisaties worstelen voortdurend om zich aan te passen aan deze veranderingskracht. Onze digitale barometer vertelt ons dat bij vele organisaties niet ontbreekt aan digitale ambities niet ontbreekt, maar de meerderheid van deze organisaties nog een lange weg te gaan hebben om zich te transformeren in dit digitale tijdperk. En de wereld staat uiteraard niet stil:  elke dag ontstaan er nieuwe toepassingen, nieuwe ondernemingen of een nieuwe “disruptors” die de bestaande elite uitdagen.\nPA’s Digital Team is een virtueel team van experts in “digital” die onze klanten vanuit verschillende invalshoeken ondersteunen in hun digitale transformaties. Het team bestaat uit sectorspecialisten, organisatie- en cultuurveranderingsexperts, customer experience en digital proposition goeroes, technologie en IT & data specialisten, samengesteld vanuit verschillende PA sector- en service teams en landen. Ons werk omvat strategie, transformatie en implementatie. We praten niet alleen over “the Internet of Things”, maar we bedenken, ontwerpen en produceren tevens de volgende generatie van “connected devices” vanuit ons Technology Centre in Cambridge (UK). Om ons Digital Team verder te versterken, en om klanten te kunnen helpen zich te transformeren in deze digital age en hun digitale bestemming te laten bereiken, maken we graag kennis met:\n(Senior) Digital Business Consultants\nmet een aantoonbaar track record als Digital Expert met een passie voor verandering: “digital natives” die deel willen uitmaken van een snelgroeiend (internationaal) team van digital (business) experts die willen helpen deze service voor PA verder uit te bouwen en samen willen werken met onze klanten in verschillende uitdagende opdrachten.\nDe rol\nBelangrijkste doel van deze rol is het nauw samenwerken met onze opdrachtgevers in innovatieve, geïntegreerde business, IT en culturele veranderingstrajecten, waarbij je tevens een leidende rol speelt in het managen van stakeholders en in de ondersteuning en het managen van organisatieverandering. Als Consultant lever je graag een bijdrage aan salesinitiatieven en Thought Leadership, met als doel een verdere uitbouw van competenties en proposities die helpen nieuwe opdrachten en opdrachtgevers te acquireren en onze bestaande klanten uit te bouwen en natuurlijk de groei van jouw eigen carrière bij PA.\nJe begrijpt als geen ander welke uitdagingen onze klanten hebben bij het streven om voordeel te behalen uit de kansen die “digital” biedt, en je hebt de passie om alles in het werk te stellen om hen hierbij succesvol te maken.\nPersoonlijke en professionele kwaliteiten\n  \n\nJe neemt een solide en aantoonbare ervaring mee in Digital Business en/of Consultancy en Business Development – een minimum van 8 tot 10 jaar is zo’n beetje de ondergrens\nJe hebt een actief netwerk in verschillende sectoren en hebt ervaring in het verkopen van professionele services binnen dit netwerk – van voorstel tot pitch en “closing the deal”\nJe hebt ervaring en expertise in digital strategie, digital business / operations ontwerp, digitale transformatie en hebt deze expertise ingezet op CxO niveau\nJe beschikt over diepgaande expertise in onderwerpen als digital marketing, customer experience, digital strategy, proposition development, analytics, case for change, technologie en IT – en je bent in staat om overtuigende marktproposities te schrijven die de aandacht van onze klanten trekken en waarmee je de concurrentie ver achter je laat. Met betrekking tot deze onderwerpen word je in de markt gezien als een Thought Leader.\nJe hebt een track record in het helpen tackelen van de grootste digitale uitdagingen van jouw klanten, en weet hoe je hen (competitief en duurzaam) voordeel kunt laten behalen uit wat “digital” hen heeft te bieden\nHet managen van gemengde klant-toeleverancier teams en het leveren van de gewenste uitkomst voor de klant is voor jou vanzelfsprekend\nSterke intellectuele en analytische vaardigheden, gebaseerd op een academische achtergrond, maar met goed ontwikkelde plannings- en realisatievaardigheden en de vaardigheid om te schakelen tussen hands-on en hands-off – afhankelijk van de situatie\nSterke klantfocus, ambitieus, ondernemend en collegiaal, een motiverende persoonlijke en authentieke stijl, team player\nBovengemiddelde presentatie-, onderhandelings- en beïnvloedingsvaardigheden, in staat om de “lead” te nemen bij organisatieverandering, organisatiesensitief en bruggenbouwer\nSterke interpersoonlijke vaardigheden, excellente schriftelijke en verbale communicatievaardigheden (in Nederland en Engels)\nProactieve houding, duidelijke ideeën, bereidheid om ook internationaal te werken\n\n \n \n \n  We’re an innovation and transformation consultancy that believes in the power of ingenuity to build a positive-human future in a technology-driven world. Our diverse teams of experts combine innovative thinking with breakthrough-technologies to progress further, faster. With a global network of FTSE 100 and Fortune 500 clients, we’ll offer you unrivaled opportunities for growth and the freedom to excel. Combining strategies, technologies and innovation, we create opportunity from complexity and deliver enduring results, enabling you to build a lasting career."
  },
  {
    "customFields": [
      {
        "title": "Become part of the team",
        "content": "<p>We are looking to hire a Google Cloud Sales Manager to join our strong (and growing) Cloud Transformation practice. This is a senior role, and one that will stretch you personally and professionally. Your role will be helping to consolidate the well-established relationship between Google and our organisation. Our ideal candidate is highly motivated, an excellent communicator, can work within a collaborative team but also on their own initiative.</p>\n<p>The PA Cloud capability has experienced significant growth and we are continuing to invest heavily in this huge market opportunity. PA is an amazing company with incredible sector and technical capabilities which makes us unique in the market.</p>\n<p>The right person will be able to utilise our incredibly talented people, customers and alliances and develop our cloud capability to meet the growing global cloud computing market. The right sales principal will be very successful in this role.</p>\n<p>As the Google Cloud Sales Manager, you will be the face of our organisation to Google Cloud Platform Services, helping to drive sales, revenue and partnerships. You will be responsible for developing the Alliance strategy for our Google partnership as well as developing our cloud business and driving revenue by working with Marketing and Google directly.</p>"
      },
      {
        "title": "What we're looking for",
        "content": "<p>You’ll need a deep understanding of the existing Cloud marketplace, the part this plays in the wider Digital Transformation strategy of enterprise organisations; and where the pros and cons lie specifically with Google Cloud in relation to hybrid and multi-cloud best practices and transformation approaches.</p>\n<p>You must be able to:</p>\n<ul>\n<li>Provide confidence through your market credibility and comfortably speak with CIO-level clients to understand their specific opportunities, goals and barriers.</li>\n<li>Be able to formulate and communicate compelling Google Cloud (hybrid and multi-cloud) propositions and solutions that can deliver tangible value to each target organisation, fast.</li>\n<li>Deliver complex and simple sales opportunities (both new name and existing clients) from inception through conclusion to on-going client and stake-holder management</li>\n</ul>\n<p> </p>\n<p>The ideal candidate compliments their business development and commercial acumen with accurate technical content to shape and sell complex technology-based Google Cloud transformation programmes in a dynamic consulting environment.</p>\n<p>You have developed your experience in shaping, selling and delivering technology-based transformation projects and programmes, and have worked in a major consultancy, agency and/or in major industry players that have successfully carried out technology-based transformations.<br /><br />Commercial Domain Skills:</p>\n<ul>\n<li>Demonstrate a proven track-record of selling successful, transformational programmes that have delivered tangible and lasting results to a number of enterprise organisations.</li>\n<li>Especially in recent years, these will have included Cloud transformation and migration programmes, pure-play, hybrid and/or multi-Cloud.</li>\n<li>Experience of ‘land and expand’ of new name wins and nurturing them into multi-million pound, established clients</li>\n<li>Comfortable in carrying commercial revenue/sales targets and a track record of achieving them.</li>\n<li>A solid understanding of the Cloud marketplace both commercially and technically</li>\n</ul>\n<p>Technology Domain Skills:</p>\n<ul>\n<li>Digital & Technology Strategy formulation, and ability to understand the implications of technology choices on business choices, and vice-versa </li>\n<li>Digital & Technology Data Architectures, including Cloud-based platforms and strategic Cloud-migration, connected devices, digital gateways, hyper-modularity, etc.</li>\n<li>Orchestration of ecosystem players/solutions providing modular components to the end-2-end architecture</li>\n<li>Big Data technologies and exploitation</li>\n<li>Experience in \"Connected Devices\" and in the \"Internet of Things\" applications, and preferably in other emerging technologies (e.g. VR/AR, Blockchain, AI, Digital Twins, etc.)</li>\n<li>Practical knowledge of digitally-enabled Service-Orientated Architecture and Processes (e.g. service design)</li>\n</ul>\n<p>Business Domain Skills:</p>\n<ul>\n<li>Complex Programme Management and Stakeholder Management</li>\n<li>Effective communication skills, both bottom-up and top-down</li>\n<li>Appreciates the bidirectional influences and dependencies between business and technology</li>\n<li>Can shape and sell complex technology-based transformation programmes</li>\n<li>Leader of Consulting Teams</li>\n<li>Develops go-to-market offerings working in collaboration with existing functional and sector teams</li>\n</ul>\n<p>Industry Experience:</p>\n<ul>\n<li>An industry background in one of Finance, Consumer Goods, Retail, Manufacturing, with a strong network, would be an advantage.</li>\n<li>A deep understanding of the most important dynamics in at least one of the B2C, B2B2C and B2B value chains is essential.</li>\n</ul>"
      },
      {
        "title": "Benefits",
        "content": "<ul>\n<li>Private medical insurance</li>\n<li>Travel Allowance</li>\n<li>25 days annual leave with the opportunity to buy 5 additional days</li>\n<li>Company pension scheme</li>\n<li>Annual performance-based bonus</li>\n<li>Life and Income protection insurance</li>\n<li>Tax efficient benefits (cycle to work, give as you earn)</li>\n<li>Voluntary benefits (Dental, critical illness, spouse/partner life assurance)</li>\n</ul>"
      },
      {
        "title": "About us",
        "content": "<p>We believe in the power of ingenuity to build a positive human future in a technology-driven world.</p>\n<p>As strategies, technologies and innovation collide, we create opportunity from complexity.</p>\n<p>Our diverse teams of experts combine innovative thinking and breakthrough use of technologies to progress further, faster. Our clients adapt and transform, and together we achieve enduring results.</p>\n<p>An innovation and transformation consultancy, we are over 3,200 specialists in consumer, defence and security, energy and utilities, financial services, government, health and life sciences, manufacturing, and transport. Our people are strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists. We operate globally from offices across the UK, US, Europe, and the Nordics.</p>\n<p>PA. Bringing Ingenuity to Life.</p>"
      },
      {
        "title": "Diversity Statement",
        "content": "<p><em>We believe that diversity makes us a stronger firm and look to employ people with different ideas, styles and skillsets. This diversity stimulates a rich, creative environment – one in which our people develop, and our clients enjoy enduring results. We’re committed to recruiting, promoting and rewarding our people solely based on their ability to contribute to PA’s goals, without regard to their sex, race, disability, religion, national origin, ethnicity, sexual orientation, age or marital status. </em></p>\n<p><strong><em>We welcome international applications, but we are unable to offer sponsorship for work permits, so you will need to have the full right to live and work in the UK. Unfortunately, your application will be automatically rejected if you do not have these rights.</em></strong></p>\n<p> </p>"
      }
    ],
    "jobFields": {
      "SLOVLIST13": "London (DIG)",
      "SLOVLIST16": "Full Time",
      "SLOVLIST15": "United Kingdom",
      "ContractTyplabel": "Permanent",
      "sJobTitle": "Google Cloud Senior Sales Manager (Management Consultant) ",
      "id": 1085,
      "siteLangauge": "UK",
      "language": "UK",
      "jobNumber": "UK00256",
      "jobTitle": "Google Cloud Senior Sales Manager (Management Consultant) ",
      "externalJobNumber": null,
      "applicationUrl": "https://apply5.lumessetalentlink.com/apply-app/pages/application-form?jobId=QIMFK026203F3VBQBLO6GLOQP-1085&langCode=en_GB",
      "strapLine": null,
      "POSTINGTIMEZONE": "Europe/London"
    },
    "id": 1085,
    "title": "Google Cloud Senior Sales Manager (Management Consultant) ",
    "city": "London",
    "country": "United Kingdom",
    "location": "London, United Kingdom",
    "capability": "Engineering & DevOps",
    "summary": "We are looking to hire a Google Cloud Sales Manager to join our strong (and growing) Cloud Transformation practice. This is a senior role, and one that will stretch you personally and professionally. Your role will be helping to consolidate the well-established relationship between Google and our organisation. Our ideal candidate is highly motivated, an excellent communicator, can work within a collaborative team but also on their own initiative.\nThe PA Cloud capability has experienced significa...",
    "fulltext": "We are looking to hire a Google Cloud Sales Manager to join our strong (and growing) Cloud Transformation practice. This is a senior role, and one that will stretch you personally and professionally. Your role will be helping to consolidate the well-established relationship between Google and our organisation. Our ideal candidate is highly motivated, an excellent communicator, can work within a collaborative team but also on their own initiative.\nThe PA Cloud capability has experienced significant growth and we are continuing to invest heavily in this huge market opportunity. PA is an amazing company with incredible sector and technical capabilities which makes us unique in the market.\nThe right person will be able to utilise our incredibly talented people, customers and alliances and develop our cloud capability to meet the growing global cloud computing market. The right sales principal will be very successful in this role.\nAs the Google Cloud Sales Manager, you will be the face of our organisation to Google Cloud Platform Services, helping to drive sales, revenue and partnerships. You will be responsible for developing the Alliance strategy for our Google partnership as well as developing our cloud business and driving revenue by working with Marketing and Google directly. You’ll need a deep understanding of the existing Cloud marketplace, the part this plays in the wider Digital Transformation strategy of enterprise organisations; and where the pros and cons lie specifically with Google Cloud in relation to hybrid and multi-cloud best practices and transformation approaches.\nYou must be able to:\n\nProvide confidence through your market credibility and comfortably speak with CIO-level clients to understand their specific opportunities, goals and barriers.\nBe able to formulate and communicate compelling Google Cloud (hybrid and multi-cloud) propositions and solutions that can deliver tangible value to each target organisation, fast.\nDeliver complex and simple sales opportunities (both new name and existing clients) from inception through conclusion to on-going client and stake-holder management\n\n \nThe ideal candidate compliments their business development and commercial acumen with accurate technical content to shape and sell complex technology-based Google Cloud transformation programmes in a dynamic consulting environment.\nYou have developed your experience in shaping, selling and delivering technology-based transformation projects and programmes, and have worked in a major consultancy, agency and/or in major industry players that have successfully carried out technology-based transformations.Commercial Domain Skills:\n\nDemonstrate a proven track-record of selling successful, transformational programmes that have delivered tangible and lasting results to a number of enterprise organisations.\nEspecially in recent years, these will have included Cloud transformation and migration programmes, pure-play, hybrid and/or multi-Cloud.\nExperience of ‘land and expand’ of new name wins and nurturing them into multi-million pound, established clients\nComfortable in carrying commercial revenue/sales targets and a track record of achieving them.\nA solid understanding of the Cloud marketplace both commercially and technically\n\nTechnology Domain Skills:\n\nDigital & Technology Strategy formulation, and ability to understand the implications of technology choices on business choices, and vice-versa \nDigital & Technology Data Architectures, including Cloud-based platforms and strategic Cloud-migration, connected devices, digital gateways, hyper-modularity, etc.\nOrchestration of ecosystem players/solutions providing modular components to the end-2-end architecture\nBig Data technologies and exploitation\nExperience in \"Connected Devices\" and in the \"Internet of Things\" applications, and preferably in other emerging technologies (e.g. VR/AR, Blockchain, AI, Digital Twins, etc.)\nPractical knowledge of digitally-enabled Service-Orientated Architecture and Processes (e.g. service design)\n\nBusiness Domain Skills:\n\nComplex Programme Management and Stakeholder Management\nEffective communication skills, both bottom-up and top-down\nAppreciates the bidirectional influences and dependencies between business and technology\nCan shape and sell complex technology-based transformation programmes\nLeader of Consulting Teams\nDevelops go-to-market offerings working in collaboration with existing functional and sector teams\n\nIndustry Experience:\n\nAn industry background in one of Finance, Consumer Goods, Retail, Manufacturing, with a strong network, would be an advantage.\nA deep understanding of the most important dynamics in at least one of the B2C, B2B2C and B2B value chains is essential.\n We believe in the power of ingenuity to build a positive human future in a technology-driven world.\nAs strategies, technologies and innovation collide, we create opportunity from complexity.\nOur diverse teams of experts combine innovative thinking and breakthrough use of technologies to progress further, faster. Our clients adapt and transform, and together we achieve enduring results.\nAn innovation and transformation consultancy, we are over 3,200 specialists in consumer, defence and security, energy and utilities, financial services, government, health and life sciences, manufacturing, and transport. Our people are strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists. We operate globally from offices across the UK, US, Europe, and the Nordics.\nPA. Bringing Ingenuity to Life."
  },
  {
    "customFields": [
      {
        "title": "Become part of the team",
        "content": "<p>Our team of designers have deep practitioner specialist skills across any or all parts of the design spectrum - from design strategy and IA, UX, interface design, through to prototyping and movement. We however display a generalist attitude; an understanding of the whole design process, and can easily navigate, communicate and practice the full spectrum.</p>\n<p>We have practical delivery skills to make actual things rather than just pictures of things. And these skills constantly evolve – so we self-teach a lot.</p>\n<p>We are passionate about the intersection between Design, UX and Front End and the possibilities for innovation at those boundaries. We work in mixed discipline highly collaborative teams, committed to building better experiences and truly believe that user experience is the responsibility of the whole project team.</p>"
      },
      {
        "title": "What we're looking for",
        "content": "<p>Lead Designers act as a visionary, leading the evolution of design best practice and ensuring creative excellence in every aspect of delivery and offer to clients.</p>\n<p>As Lead Designer, you will have design responsibility for multiple streams of work, across multiple clients. You will support the CDO in leading the long term creative output, with shared responsibility for the welfare, creativity, performance and profitability of the Design Team.</p>\n<p>You will develop strong, long-term strategic relationships with clients, shaping their understanding of digital practice and increasing their confidence when commissioning digital experiences.</p>\n<p>You will formulate and articulate design strategy and processes. You will lead the end to end design aspects of our work and ensure it is robust, progressive and commercially strong.</p>\n<p><strong>What you’ll do:</strong></p>\n<p>As Lead Designer you will have been developing responses to complex digital ecosystem problems for 7+ years within an agency or design studio. You will therefore have extensive experience and advanced knowledge of a wide range of design tools, design software, techniques and processes - and know when to use them. Your key tasks and responsibilities will be to:</p>\n<ul>\n<li>Formulate and lead design strategy and processes</li>\n<li>Clearly communicate design direction to others; oversee and direct the team but be ‘in’ the work yourself, with rolled up sleeves</li>\n<li>Direct and produce artefacts across the full design spectrum as required by projects</li>\n<li>Challenge inappropriate ideas and solutions</li>\n<li>Build and manage relationships with internal teams and clients</li>\n<li>Present, explain and justify design solutions to clients</li>\n<li>Assist with managing the pipeline of future design work and the pipeline of designers - and assign designers to projects</li>\n<li>Be involved in pitches and new business proposals</li>\n<li>Have line management responsibility for designers: develop coaching, mentoring and training plans, organise and run performance appraisals, input into salary negotiations/ reward management</li>\n<li>Assist with recruitment and onboarding of new staff.</li>\n</ul>\n<p><strong>Key Skills:</strong></p>\n<p><strong> </strong>Leadership</p>\n<ul>\n<li>Accurately scope, estimate effort and define activities for large complex programmes of work (e.g. in proposals/SOWs)</li>\n<li>Know the team well, their skills and interests; cast blended teams that compliment and challenge each other</li>\n<li>Identify the way forward, set the design direction</li>\n<li>Set and manage clear expectations about quality and speed of project output</li>\n<li>Recognise opportunities for specialist engagement and oversee their contribution.</li>\n</ul>\n<p>Practitioner:</p>\n<ul>\n<li>Be an outstanding and highly skilled and experienced design practitioner covering all aspects of digital responsive interaction design</li>\n<li>Be able to use the usual design and prototyping software to the highest level (eg: Sketch, Illustrator, Invision, Axure, Omnigraffle, Sublime/Atom, Keynote, pen and paper)</li>\n<li>Confidently sketch target customer experiences, journeys and interfaces in collaborative teams and in workshops with clients.</li>\n</ul>\n<p><strong> </strong>About You:</p>\n<ul>\n<li>You are delightfully non-ego driven and passionate about what you do</li>\n<li>You’re constantly learning and challenging your own thinking</li>\n<li>You inspire others around you to be better and enjoy mentoring / knowledge sharing</li>\n<li>You have a strong work ethic, are well organised, and can manage complexity across multiple projects</li>\n<li>You have an eye for detail and are an exceptional communicator</li>\n<li>You are collaborative, friendly, ‘hunchy’ with bags of initiative</li>\n</ul>\n<p> </p>"
      },
      {
        "title": "Benefits",
        "content": "<ul>\n<li>Private medical insurance</li>\n<li>Interest free season ticket loan</li>\n<li>25 days annual leave with the opportunity to buy 5 additional days</li>\n<li>Company pension scheme</li>\n<li>Annual performance-based bonus</li>\n<li>Life and Income protection insurance</li>\n<li>Tax efficient benefits (cycle to work, give as you earn)</li>\n<li>Voluntary benefits (Dental, critical illness, spouse/partner life assurance)</li>\n</ul>\n<p>#LI-PK1</p>"
      },
      {
        "title": "About us",
        "content": "<p>We believe in the power of ingenuity to build a positive human future in a technology-driven world.</p>\n<p>As strategies, technologies and innovation collide, we create opportunity from complexity.</p>\n<p>Our diverse teams of experts combine innovative thinking and breakthrough use of technologies to progress further, faster. Our clients adapt and transform, and together we achieve enduring results.</p>\n<p>An innovation and transformation consultancy, we are over 3,200 specialists in consumer, defence and security, energy and utilities, financial services, government, health and life sciences, manufacturing, and transport. Our people are strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists. We operate globally from offices across the UK, US, Europe, and the Nordics.</p>\n<p>PA. Bringing Ingenuity to Life.</p>"
      },
      {
        "title": "Inclusion & Diversity",
        "content": "<p>We believe that diversity makes us a stronger firm and look to employ people with different ideas, styles and skillsets. This diversity stimulates a rich, creative environment – one in which our people develop, and our clients enjoy enduring results. We’re committed to recruiting, promoting and rewarding our people solely based on their ability to contribute to PA’s goals, without regard to their sex, race, disability, religion, national origin, ethnicity, sexual orientation, age or marital status. <br /><br />We welcome international applications, but we are unable to offer sponsorship for work permits, so you will need to have the full right to live and work in the UK. Unfortunately, your application will be automatically rejected if you do not have these rights.</p>\n<p> </p>"
      }
    ],
    "jobFields": {
      "SLOVLIST13": "London (DIG)",
      "SLOVLIST16": "Full Time",
      "SLOVLIST15": "United Kingdom",
      "ContractTyplabel": "Permanent",
      "sJobTitle": "Lead Designer - Principal Consultant",
      "id": 1096,
      "siteLangauge": "UK",
      "language": "UK",
      "jobNumber": "UK00254",
      "jobTitle": "Lead Designer - Principal Consultant",
      "externalJobNumber": null,
      "applicationUrl": "https://apply5.lumessetalentlink.com/apply-app/pages/application-form?jobId=QIMFK026203F3VBQBLO6GLOQP-1096&langCode=en_GB",
      "strapLine": null,
      "POSTINGTIMEZONE": "Europe/London"
    },
    "id": 1096,
    "title": "Lead Designer - Principal Consultant",
    "city": "London",
    "country": "United Kingdom",
    "location": "London, United Kingdom",
    "capability": "Design",
    "summary": "Our team of designers have deep practitioner specialist skills across any or all parts of the design spectrum - from design strategy and IA, UX, interface design, through to prototyping and movement. We however display a generalist attitude; an understanding of the whole design process, and can easily navigate, communicate and practice the full spectrum.\nWe have practical delivery skills to make actual things rather than just pictures of things. And these skills constantly evolve – so we self-te...",
    "fulltext": "Our team of designers have deep practitioner specialist skills across any or all parts of the design spectrum - from design strategy and IA, UX, interface design, through to prototyping and movement. We however display a generalist attitude; an understanding of the whole design process, and can easily navigate, communicate and practice the full spectrum.\nWe have practical delivery skills to make actual things rather than just pictures of things. And these skills constantly evolve – so we self-teach a lot.\nWe are passionate about the intersection between Design, UX and Front End and the possibilities for innovation at those boundaries. We work in mixed discipline highly collaborative teams, committed to building better experiences and truly believe that user experience is the responsibility of the whole project team. Lead Designers act as a visionary, leading the evolution of design best practice and ensuring creative excellence in every aspect of delivery and offer to clients.\nAs Lead Designer, you will have design responsibility for multiple streams of work, across multiple clients. You will support the CDO in leading the long term creative output, with shared responsibility for the welfare, creativity, performance and profitability of the Design Team.\nYou will develop strong, long-term strategic relationships with clients, shaping their understanding of digital practice and increasing their confidence when commissioning digital experiences.\nYou will formulate and articulate design strategy and processes. You will lead the end to end design aspects of our work and ensure it is robust, progressive and commercially strong.\nWhat you’ll do:\nAs Lead Designer you will have been developing responses to complex digital ecosystem problems for 7+ years within an agency or design studio. You will therefore have extensive experience and advanced knowledge of a wide range of design tools, design software, techniques and processes - and know when to use them. Your key tasks and responsibilities will be to:\n\nFormulate and lead design strategy and processes\nClearly communicate design direction to others; oversee and direct the team but be ‘in’ the work yourself, with rolled up sleeves\nDirect and produce artefacts across the full design spectrum as required by projects\nChallenge inappropriate ideas and solutions\nBuild and manage relationships with internal teams and clients\nPresent, explain and justify design solutions to clients\nAssist with managing the pipeline of future design work and the pipeline of designers - and assign designers to projects\nBe involved in pitches and new business proposals\nHave line management responsibility for designers: develop coaching, mentoring and training plans, organise and run performance appraisals, input into salary negotiations/ reward management\nAssist with recruitment and onboarding of new staff.\n\nKey Skills:\n Leadership\n\nAccurately scope, estimate effort and define activities for large complex programmes of work (e.g. in proposals/SOWs)\nKnow the team well, their skills and interests; cast blended teams that compliment and challenge each other\nIdentify the way forward, set the design direction\nSet and manage clear expectations about quality and speed of project output\nRecognise opportunities for specialist engagement and oversee their contribution.\n\nPractitioner:\n\nBe an outstanding and highly skilled and experienced design practitioner covering all aspects of digital responsive interaction design\nBe able to use the usual design and prototyping software to the highest level (eg: Sketch, Illustrator, Invision, Axure, Omnigraffle, Sublime/Atom, Keynote, pen and paper)\nConfidently sketch target customer experiences, journeys and interfaces in collaborative teams and in workshops with clients.\n\n About You:\n\nYou are delightfully non-ego driven and passionate about what you do\nYou’re constantly learning and challenging your own thinking\nYou inspire others around you to be better and enjoy mentoring / knowledge sharing\nYou have a strong work ethic, are well organised, and can manage complexity across multiple projects\nYou have an eye for detail and are an exceptional communicator\nYou are collaborative, friendly, ‘hunchy’ with bags of initiative\n\n  We believe in the power of ingenuity to build a positive human future in a technology-driven world.\nAs strategies, technologies and innovation collide, we create opportunity from complexity.\nOur diverse teams of experts combine innovative thinking and breakthrough use of technologies to progress further, faster. Our clients adapt and transform, and together we achieve enduring results.\nAn innovation and transformation consultancy, we are over 3,200 specialists in consumer, defence and security, energy and utilities, financial services, government, health and life sciences, manufacturing, and transport. Our people are strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists. We operate globally from offices across the UK, US, Europe, and the Nordics.\nPA. Bringing Ingenuity to Life. We believe that diversity makes us a stronger firm and look to employ people with different ideas, styles and skillsets. This diversity stimulates a rich, creative environment – one in which our people develop, and our clients enjoy enduring results. We’re committed to recruiting, promoting and rewarding our people solely based on their ability to contribute to PA’s goals, without regard to their sex, race, disability, religion, national origin, ethnicity, sexual orientation, age or marital status. We welcome international applications, but we are unable to offer sponsorship for work permits, so you will need to have the full right to live and work in the UK. Unfortunately, your application will be automatically rejected if you do not have these rights.\n "
  },
  {
    "customFields": [
      {
        "title": "Become part of the team",
        "content": "<p>Designers at PA have deep practitioner specialist skills across any or all parts of the design spectrum - from design strategy and IA, UX, interface design, through to prototyping and movement. We however display a generalist attitude; an understanding of the whole design process, and can easily navigate, communicate and practice the full spectrum.<br /> <br />We have practical delivery skills to make actual things rather than just pictures of things. And these skills constantly evolve – so we self-teach a lot.<br /> <br />We are passionate about the intersection between Design, UX and Front End and the possibilities for innovation at those boundaries. We work in mixed discipline highly collaborative teams, committed to building better experiences and truly believe that user experience is the responsibility of the whole project team.</p>"
      },
      {
        "title": "What we're looking for",
        "content": "<p>We are looking for a Senior hybrid UX and UI designer to join our established team that is currently working on a corporate transactional environment for a global bank. In this role you will be working within the internal Design team, and across our client teams, to design and deliver transactional applications across desktop and mobile platforms. You will be working closely with the business stakeholders and an offshore team to align design standards across different territories. You will be working on site with our client for some of your time.<br /> <br />You will need understand the requirements gathered by Business Analysts, develop and present ideas and prototypes daily. You will also liaise with business representatives and technical build partners at various points of the project. You'll work through iterations of the projects, creating interactive prototypes and presenting these over conference calls and face to face to a large stakeholder base.<br /> <br />What you’ll do:<br />• Collaborating with multi-disciplinary teams, ensuring the user experience delivers on the strategic vision and is achievable within the technical constraints of the project<br />• Working closely with our clients’ BA to help shape solutions and to rapidly visualise a proposition, through sketching and prototyping while speaking their language<br />• Production of detailed user experience deliverables from sketches, wireframes, prototypes, user flows and interface designs<br />• Navigating comfortably between a mix of being \"hands-on-in-the-detail” of project and contributing to the wider program of work<br />• Presenting your ideas to a varied audience from marketing execs to technical architects and developers<br />• Briefing developers, ensuring they understand what is required from a design perspective<br />•  The role is heavily client-facing.<br /> <br />Key Skills:<br />• Understanding client requirements and expectations and translating these into best-in-class design solutions; and articulate robust rational to back up these decisions<br />• Experience working in and managing complex multi-stakeholder environments<br />• Be comfortable rapidly sketching, stamping concepts and prototypes as well as producing formal UX and visual design deliverables<br />• Be able to interpret and follow design guidelines and principles<br />• Solid Axure, Sketch, Invision and Flinto (optional) skills<br />• Strong communication skills (written and verbal)<br />• Willing to learn new tools as needed<br /> <br />About You:<br />• You are delightfully non-ego driven and passionate about what you do<br />• You’re constantly learning and challenging your own thinking<br />• You inspire others around you to be better and enjoy mentoring / knowledge sharing<br />• You have a strong work ethic, are well organised, and can manage complexity across multiple projects<br />• You have an eye for detail and are an exceptional communicator<br />• You are collaborative, friendly, ‘hunchy’ with bags of initiative</p>"
      },
      {
        "title": "Benefits",
        "content": "<p>• Private medical insurance<br />• Interest free season ticket loan<br />• 25 days annual leave with the opportunity to buy 5 additional days<br />• Company pension scheme<br />• Annual performance-based bonus<br />• Life and Income protection insurance<br />• Tax efficient benefits (cycle to work, give as you earn)<br />• Voluntary benefits (Dental, critical illness, spouse/partner life assurance)<br /> <br />#LI-PK1</p>"
      },
      {
        "title": "About us",
        "content": "<p>We believe in the power of ingenuity to build a positive human future in a technology-driven world.<br /> <br />As strategies, technologies and innovation collide, we create opportunity from complexity.<br /> <br />Our diverse teams of experts combine innovative thinking and breakthrough use of technologies to progress further, faster. Our clients adapt and transform, and together we achieve enduring results.<br /> <br />An innovation and transformation consultancy, we are over 3,200 specialists in consumer, defence and security, energy and utilities, financial services, government, health and life sciences, manufacturing, and transport. Our people are strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists. We operate globally from offices across the UK, US, Europe, and the Nordics.<br /> <br />PA. Bringing Ingenuity to Life.</p>"
      },
      {
        "title": "Diversity Statement",
        "content": "<p>We believe that diversity makes us a stronger firm and look to employ people with different ideas, styles and skillsets. This diversity stimulates a rich, creative environment – one in which our people develop, and our clients enjoy enduring results. We’re committed to recruiting, promoting and rewarding our people solely based on their ability to contribute to PA’s goals, without regard to their sex, race, disability, religion, national origin, ethnicity, sexual orientation, age or marital status.<br /> <br />We welcome international applications, but we are unable to offer sponsorship for work permits, so you will need to have the full right to live and work in the UK. Unfortunately, your application will be automatically rejected if you do not have these rights.</p>"
      }
    ],
    "jobFields": {
      "SLOVLIST13": "London (DIG)",
      "SLOVLIST16": "Full Time",
      "SLOVLIST15": "United Kingdom",
      "ContractTyplabel": "Permanent",
      "sJobTitle": "Senior Designer - Principal Consultant",
      "id": 1094,
      "siteLangauge": "UK",
      "language": "UK",
      "jobNumber": "UK00255",
      "jobTitle": "Senior Designer - Principal Consultant",
      "externalJobNumber": null,
      "applicationUrl": "https://apply5.lumessetalentlink.com/apply-app/pages/application-form?jobId=QIMFK026203F3VBQBLO6GLOQP-1094&langCode=en_GB",
      "strapLine": null,
      "POSTINGTIMEZONE": "Europe/London"
    },
    "id": 1094,
    "title": "Senior Designer - Principal Consultant",
    "city": "London",
    "country": "United Kingdom",
    "location": "London, United Kingdom",
    "capability": "Design",
    "summary": "Designers at PA have deep practitioner specialist skills across any or all parts of the design spectrum - from design strategy and IA, UX, interface design, through to prototyping and movement. We however display a generalist attitude; an understanding of the whole design process, and can easily navigate, communicate and practice the full spectrum. We have practical delivery skills to make actual things rather than just pictures of things. And these skills constantly evolve – so we self-teach a ...",
    "fulltext": "Designers at PA have deep practitioner specialist skills across any or all parts of the design spectrum - from design strategy and IA, UX, interface design, through to prototyping and movement. We however display a generalist attitude; an understanding of the whole design process, and can easily navigate, communicate and practice the full spectrum. We have practical delivery skills to make actual things rather than just pictures of things. And these skills constantly evolve – so we self-teach a lot. We are passionate about the intersection between Design, UX and Front End and the possibilities for innovation at those boundaries. We work in mixed discipline highly collaborative teams, committed to building better experiences and truly believe that user experience is the responsibility of the whole project team. We are looking for a Senior hybrid UX and UI designer to join our established team that is currently working on a corporate transactional environment for a global bank. In this role you will be working within the internal Design team, and across our client teams, to design and deliver transactional applications across desktop and mobile platforms. You will be working closely with the business stakeholders and an offshore team to align design standards across different territories. You will be working on site with our client for some of your time. You will need understand the requirements gathered by Business Analysts, develop and present ideas and prototypes daily. You will also liaise with business representatives and technical build partners at various points of the project. You'll work through iterations of the projects, creating interactive prototypes and presenting these over conference calls and face to face to a large stakeholder base. What you’ll do:• Collaborating with multi-disciplinary teams, ensuring the user experience delivers on the strategic vision and is achievable within the technical constraints of the project• Working closely with our clients’ BA to help shape solutions and to rapidly visualise a proposition, through sketching and prototyping while speaking their language• Production of detailed user experience deliverables from sketches, wireframes, prototypes, user flows and interface designs• Navigating comfortably between a mix of being \"hands-on-in-the-detail” of project and contributing to the wider program of work• Presenting your ideas to a varied audience from marketing execs to technical architects and developers• Briefing developers, ensuring they understand what is required from a design perspective•  The role is heavily client-facing. Key Skills:• Understanding client requirements and expectations and translating these into best-in-class design solutions; and articulate robust rational to back up these decisions• Experience working in and managing complex multi-stakeholder environments• Be comfortable rapidly sketching, stamping concepts and prototypes as well as producing formal UX and visual design deliverables• Be able to interpret and follow design guidelines and principles• Solid Axure, Sketch, Invision and Flinto (optional) skills• Strong communication skills (written and verbal)• Willing to learn new tools as needed About You:• You are delightfully non-ego driven and passionate about what you do• You’re constantly learning and challenging your own thinking• You inspire others around you to be better and enjoy mentoring / knowledge sharing• You have a strong work ethic, are well organised, and can manage complexity across multiple projects• You have an eye for detail and are an exceptional communicator• You are collaborative, friendly, ‘hunchy’ with bags of initiative We believe in the power of ingenuity to build a positive human future in a technology-driven world. As strategies, technologies and innovation collide, we create opportunity from complexity. Our diverse teams of experts combine innovative thinking and breakthrough use of technologies to progress further, faster. Our clients adapt and transform, and together we achieve enduring results. An innovation and transformation consultancy, we are over 3,200 specialists in consumer, defence and security, energy and utilities, financial services, government, health and life sciences, manufacturing, and transport. Our people are strategists, innovators, designers, consultants, digital experts, scientists, engineers and technologists. We operate globally from offices across the UK, US, Europe, and the Nordics. PA. Bringing Ingenuity to Life."
  }
]
